<a href="https://colab.research.google.com/github/Silverstrive/Naufaliawan-Ghibran/blob/main/Kelompok_7_Tugas_M6_PSD.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# TUGAS
# Pengenalan Dasar Library Pandas

Kelompok

1. Ikhwan Maulana
2. Micoandar Justinus M
3. Naufailiawan Ghibran
4. Raka Abdilah
5. Reizza Aliffian

In [ ]:
# import libraries
import numpy as np
import pandas as pd

In [ ]:
# Membuat array "df" satu dimensi dengan Pandas
# nilainya [1,3,4,5]
ser = pd.Series([1, 2, 3, 4, 5])
print(ser)

# Membuat dataframe dengan nilai berikut:
# 'Nama' : ['Andi', 'Budi', 'Dodo', 'Ema', 'Kari']
# 'Nilai' : [80, 20, 90, 40, 55]
# 'Kelas' : ['3B', '3A', '3B', '3B', '3A']
df2 = pd.DataFrame(
    {
        "NAMA": ["ANDI","BUDI","DODO","EMA","KARI"],
        "NILAI": np.array(["80","20","90","40","55"], dtype="int64"),
        "KELAS": pd.Categorical(["3B", "3A", "3B", "3B","3A"]),
    }
)

print('\n', df2)

# Print seluruh baris pada kolom Nama
print("\n",df2['NAMA'])
# Sortir data berdasarkan Nilai tertinggi ke Nilai terendah
df2 = df2.sort_values(by='NILAI', ascending=False)
print("\n",df2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

    NAMA  NILAI KELAS
0  ANDI     80    3B
1  BUDI     20    3A
2  DODO     90    3B
3   EMA     40    3B
4  KARI     55    3A

 0    ANDI
1    BUDI
2    DODO
3     EMA
4    KARI
Name: NAMA, dtype: object

    NAMA  NILAI KELAS
2  DODO     90    3B
0  ANDI     80    3B
4  KARI     55    3A
3   EMA     40    3B
1  BUDI     20    3A

# Bermain dengan Real Data
1. Download data dari link berikut: https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries/

2. Save ds_salaries.csv pada Google Drive

In [ ]:
# load data ds_salaries.csv dengan nama variabel "df"
import os
df = pd.read_csv(os.path.abspath("ds_salaries.csv"))
print("\n",df)

      Unnamed: 0  work_year experience_level employment_type  \
0             0       2020               MI              FT
1             1       2020               SE              FT
2             2       2020               SE              FT
3             3       2020               MI              FT
4             4       2020               SE              FT
..          ...        ...              ...             ...
602         602       2022               SE              FT
603         603       2022               SE              FT
604         604       2022               SE              FT
605         605       2022               SE              FT
606         606       2022               MI              FT

                      job_title  salary salary_currency  salary_in_usd  \
0                Data Scientist   70000             EUR          79833
1    Machine Learning Scientist  260000             USD         260000
2             Big Data Engineer   85000             GBP         109024
3          Product Data Analyst   20000             USD          20000
4     Machine Learning Engineer  150000             USD         150000
..                          ...     ...             ...            ...
602               Data Engineer  154000             USD         154000
603               Data Engineer  126000             USD         126000
604                Data Analyst  129000             USD         129000
605                Data Analyst  150000             USD         150000
606                AI Scientist  200000             USD         200000

    employee_residence  remote_ratio company_location company_size
0                   DE             0               DE            L
1                   JP             0               JP            S
2                   GB            50               GB            M
3                   HN             0               HN            S
4                   US            50               US            L
..                 ...           ...              ...          ...
602                 US           100               US            M
603                 US           100               US            M
604                 US             0               US            M
605                 US           100               US            M
606                 IN           100               US            L

[607 rows x 12 columns]

In [ ]:
# print 5 baris teratas
print('Data Teratas:')
print(df.head())
print(df.head(5))

Data Teratas:
   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT

                    job_title  salary salary_currency  salary_in_usd  \
0              Data Scientist   70000             EUR          79833
1  Machine Learning Scientist  260000             USD         260000
2           Big Data Engineer   85000             GBP         109024
3        Product Data Analyst   20000             USD          20000
4   Machine Learning Engineer  150000             USD         150000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L
   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT

                    job_title  salary salary_currency  salary_in_usd  \
0              Data Scientist   70000             EUR          79833
1  Machine Learning Scientist  260000             USD         260000
2           Big Data Engineer   85000             GBP         109024
3        Product Data Analyst   20000             USD          20000
4   Machine Learning Engineer  150000             USD         150000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L

In [ ]:
# print 5 baris terakhir
print('\nData Terakhir:')
print(df.tail())
print(df.tail(3))

Data Terakhir:
     Unnamed: 0  work_year experience_level employment_type      job_title  \
602         602       2022               SE              FT  Data Engineer
603         603       2022               SE              FT  Data Engineer
604         604       2022               SE              FT   Data Analyst
605         605       2022               SE              FT   Data Analyst
606         606       2022               MI              FT   AI Scientist

     salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
602  154000             USD         154000                 US           100
603  126000             USD         126000                 US           100
604  129000             USD         129000                 US             0
605  150000             USD         150000                 US           100
606  200000             USD         200000                 IN           100

    company_location company_size
602               US            M
603               US            M
604               US            M
605               US            M
606               US            L
     Unnamed: 0  work_year experience_level employment_type     job_title  \
604         604       2022               SE              FT  Data Analyst
605         605       2022               SE              FT  Data Analyst
606         606       2022               MI              FT  AI Scientist

     salary salary_currency  salary_in_usd employee_residence  remote_ratio  \
604  129000             USD         129000                 US             0
605  150000             USD         150000                 US           100
606  200000             USD         200000                 IN           100

    company_location company_size
604               US            M
605               US            M
606               US            L

In [ ]:
# Print nama kolom
print(df.columns)

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [ ]:
# Tampilkan data baris ke 5-10 pada kolom job_title dan company_location
brs  = df[5:11]
print('\nbaris\n', brs)
brs  = df['job_title']
brs2 = df['company_location']
print('\nbaris job_title\n', brs,)
print('\nbaris company_location\n',brs2)

baris
     Unnamed: 0  work_year experience_level employment_type  \
5            5       2020               EN              FT
6            6       2020               SE              FT
7            7       2020               MI              FT
8            8       2020               MI              FT
9            9       2020               SE              FT
10          10       2020               EN              FT

                job_title    salary salary_currency  salary_in_usd  \
5            Data Analyst     72000             USD          72000
6     Lead Data Scientist    190000             USD         190000
7          Data Scientist  11000000             HUF          35735
8   Business Data Analyst    135000             USD         135000
9      Lead Data Engineer    125000             USD         125000
10         Data Scientist     45000             EUR          51321

   employee_residence  remote_ratio company_location company_size
5                  US           100               US            L
6                  US           100               US            S
7                  HU            50               HU            L
8                  US           100               US            L
9                  NZ            50               NZ            S
10                 FR             0               FR            S

baris job_title
 0                  Data Scientist
1      Machine Learning Scientist
2               Big Data Engineer
3            Product Data Analyst
4       Machine Learning Engineer
                  ...
602                 Data Engineer
603                 Data Engineer
604                  Data Analyst
605                  Data Analyst
606                  AI Scientist
Name: job_title, Length: 607, dtype: object

baris company_location
 0      DE
1      JP
2      GB
3      HN
4      US
       ..
602    US
603    US
604    US
605    US
606    US
Name: company_location, Length: 607, dtype: object

In [ ]:
# Hitung rata-rata salary_in_usd
rata = df['salary_in_usd']
print(rata.mean())

112297.86985172982

In [ ]:
# Simpan data baris ke 5-20 ke bentuk .csv dengan nama "sparse.csv"
df = df[5:21]
df.to_csv("sparse.csv")